import pandas as pd

for i in range(102,110):

    df1 = pd.read_csv('../dataset/{}_1_2_9.csv'.format(i))
    df2 = pd.read_csv('../dataset/{}_1_2_10.csv'.format(i))
    df3 = pd.read_csv('../dataset/{}_1_2_11.csv'.format(i))

    merged_df = pd.merge(df1,df2, on=['設立別','學程別','群科別','畢業生人數'])
    merged_df = pd.merge(merged_df,df3,on=['設立別','學程別','群科別','畢業生人數'])

    merged_df.to_csv('../pre_dataset/{}.csv'.format(i), index=False)

final_df = pd.DataFrame()
ls = ["設立別","學程別","群科別","畢業生人數","升公立大學日間部人數","升公立大學進修學士班人數","升私立大學日間部人數","升私立大學進修學士班人數","升公立二專日間部人數","升公立二專夜間部人數","升私立二專日間部人數","升私立二專夜間部人數","升警察大學人數","升警察專科學校人數","升軍事院校人數","赴國外_大陸就讀人數","升其他學校人數","升學率","升公立大學日間部比率","升公立大學進修學士班比率","升私立大學日間部比率","升私立大學進修學士班比率","升公立二專日間部比率","升公立二專夜間部比率","升私立二專日間部比率","升私立二專夜間部比率","升警察大學比率","升警察專科學校比率","升軍事院校比率","赴國外_大陸就讀比率","升其他學校比率","就農_林_漁_牧業人數","就礦業及土石採取業人數","就製造業人數","就電力及燃氣供應業人數","就用水供應及污染整治業人數","就營造業人數","就批發及零售業人數","就運輸及倉儲業人數","就住宿及餐飲業人數","就資訊及通訊傳播業人數","就金融及保險業人數","就不動產業人數","就專業_科學及技術服務業人數","就支援服務業人數","就公共行政及國防；強制性社會安全人數","就教育服務業人數","就醫療保健及社會工作服務業人數","就藝術_娛樂及休閒服務業人數","就其他服務業人數","就業率","就農_林_漁_牧業比率","就礦業及土石採取業比率","就製造業比率","就電力及燃氣供應業比率","就用水供應及污染整治業比率","就營造業比率","就批發及零售業比率","就運輸及倉儲業比率","就住宿及餐飲業比率","就資訊及通訊傳播業比率","就金融及保險業比率","就不動產業比率","就專業_科學及技術服務業比率","就支援服務業比率","就公共行政及國防；強制性社會安全比率","就教育服務業比率","就醫療保健及社會工作服務業比率","就藝術_娛樂及休閒服務業比率","就其他服務業比率","正在接受職業訓練人數","正在軍中服役人數","需要工作而未找到人數","補習或準備升學人數","健康不良在家休養人數","準備出國人數","其他人數","正在接受職業訓練比率","正在軍中服役比率","需要工作而未找到比率","補習或準備升學比率","健康不良在家休養比率","準備出國比率","其他比率"]
for i in range(1,9):

    df = pd.read_csv('../pre_dataset/{}.csv'.format(i+101))
    df.columns = ls
    df.insert(0, "年份", i + 101)
    final_df = pd.concat([final_df, df], ignore_index=True)

final_df.to_csv('../pre_dataset/final.csv', index=False)